In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df1 = pd.read_csv('/Users/yairmartinez/Documents/GitHub/Data_visualization/Extract/sales_train_evaluation.csv' )
df2= pd.read_csv('/Users/yairmartinez/Documents/GitHub/Data_visualization/Extract/sell_prices.csv')
df3= pd.read_csv('/Users/yairmartinez/Documents/GitHub/Data_visualization/Extract/calendar.csv')

In [3]:
# Data Frame 1
df1_CA_1 = df1[ ( df1['store_id'] == 'CA_1' ) ]
df1_CA_2 = df1[ ( df1['store_id'] == 'CA_2' ) ]
df1_CA_3 = df1[ ( df1['store_id'] == 'CA_3' ) ]
df1_CA_4 = df1[ ( df1['store_id'] == 'CA_4' ) ]

df1_TX_1 = df1[ ( df1['store_id'] == 'TX_1' ) ]
df1_TX_2 = df1[ ( df1['store_id'] == 'TX_2' ) ]
df1_TX_3 = df1[ ( df1['store_id'] == 'TX_3' ) ]

df1_WI_1 = df1[ ( df1['store_id'] == 'WI_1' ) ]
df1_WI_2 = df1[ ( df1['store_id'] == 'WI_2' ) ]
df1_WI_3 = df1[ ( df1['store_id'] == 'WI_3' ) ]

# Data Frame 2 
df2_CA_1 = df2[ ( df2['store_id'] == 'CA_1' ) ]
df2_CA_2 = df2[ ( df2['store_id'] == 'CA_2' ) ]
df2_CA_3 = df2[ ( df2['store_id'] == 'CA_3' ) ]
df2_CA_4 = df2[ ( df2['store_id'] == 'CA_4' ) ]

df2_TX_1 = df2[ ( df2['store_id'] == 'TX_1' ) ]
df2_TX_2 = df2[ ( df2['store_id'] == 'TX_2' ) ]
df2_TX_3 = df2[ ( df2['store_id'] == 'TX_3' ) ]

df2_WI_1 = df2[ ( df2['store_id'] == 'WI_1' ) ]
df2_WI_2 = df2[ ( df2['store_id'] == 'WI_2' ) ]
df2_WI_3 = df2[ ( df2['store_id'] == 'WI_3' ) ]

In [5]:
df1_CA_1.head(2)

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,1,2,1,1,0,0,0,0,0

In [21]:
df2_CA_1.groupby(['item_id', 'wm_yr_wk'] ).head(5)

       store_id        item_id  wm_yr_wk  sell_price
0          CA_1  HOBBIES_1_001     11325        9.58
1          CA_1  HOBBIES_1_001     11326        9.58
2          CA_1  HOBBIES_1_001     11327        8.26
3          CA_1  HOBBIES_1_001     11328        8.26
4          CA_1  HOBBIES_1_001     11329        8.26
...         ...            ...       ...         ...
698407     CA_1    FOODS_3_827     11617        1.00
698408     CA_1    FOODS_3_827     11618        1.00
698409     CA_1    FOODS_3_827     11619        1.00
698410     CA_1    FOODS_3_827     11620        1.00
698411     CA_1    FOODS_3_827     11621        1.00

[698412 rows x 4 columns]

In [9]:
# Dic day to week
dict_d_2_week =dict(zip( df3['d'], df3['wm_yr_wk']))

In [ ]:
# Dic day to week
sust= []
# Change d for week 
for x in df1_CA_1:
    if x in  dict_d_2_week:
        sust.append ( dict_d_2_week[x] )

print(sust)
# df1.iloc[0, 6:] = sust

In [29]:
df1_CA_1.iloc[ if     ]

id          HOBBIES_1_001_CA_1_evaluation
item_id                     HOBBIES_1_001
dept_id                         HOBBIES_1
cat_id                            HOBBIES
store_id                             CA_1
                        ...
d_1937                                  0
d_1938                                  3
d_1939                                  3
d_1940                                  0
d_1941                                  1
Name: 0, Length: 1947, dtype: object

In [28]:
df1_CA_1.columns

Index(['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id', 'd_1',
       'd_2', 'd_3', 'd_4',
       ...
       'd_1932', 'd_1933', 'd_1934', 'd_1935', 'd_1936', 'd_1937', 'd_1938',
       'd_1939', 'd_1940', 'd_1941'],
      dtype='object', length=1947)

In [ ]:
df = df1_CA_1.apply( lambda x: x['store_id']     )